tap "homebrew/bundle"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"

brew "mas"

# Terminal
brew "fish"
brew "tmux"

brew "readline"
brew "reattach-to-user-namespace" # for Tmux

cask "wezterm"

# GNU utils
brew "coreutils"
brew "findutils"
brew "gnu-sed"

# CLI/Dev tools
brew "autojump"
brew "bat"
brew "diff-so-fancy"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "imagemagick"
brew "jq"
brew "mike-engel/jwt-cli/jwt-cli"
brew "macos-trash"
brew "openssh"
brew "pstree"
brew "rename"
brew "ripgrep"
brew "rtx"
brew "tree"
brew "unar" # https://theunarchiver.com/command-line
brew "watch"
cask "charles"


# Editor/IDE
mas "Xcode", id: 497799835
brew "neovim"
cask "emacs"
cask "visual-studio-code"

brew "aspell"
# brew "ctags" confliting with universal-ctags which is used by global
# brew "global" emacs has its own ctags ...


# WEB Browser
cask "firefox"
cask "google-chrome"


# VM/Container
brew "colima"
brew "docker"
# cask "docker" # use colima
# cask "vagrant"


# Cloud and Ops
brew "hashicorp/tap/terraform"
brew "act"
brew "awscli"
cask "aws-vault"


# Customize macOS
cask "bettertouchtool" # settings are synced with Dropbox
cask "karabiner-elements"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Other Apps
cask "1password"
cask "1password-cli"
cask "alfred"
cask "anki"
cask "slack"
cask "zoom"

mas "Things", id: 904280696
mas "Dato", id: 1470584107
mas "Day One", id: 1055511498

# Fonts
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"
