tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "mas"

# Terminal
brew "fish"
brew "tmux"
cask "iterm2"

brew "readline"
brew "reattach-to-user-namespace" # for Tmux


# Dev tools
# brew "asdf" # consider Nix
brew "bat"
brew "coreutils"
brew "diff-so-fancy"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "imagemagick"
brew "jq"
brew "mike-engel/jwt-cli/jwt-cli"
brew "openssh"
brew "pstree"
brew "rename"
brew "ripgrep"
brew "rmtrash"
brew "tree"
brew "unar" # https://theunarchiver.com/command-line
brew "watch"
cask "charles"


# Editor/IDE
mas "Xcode", id: 497799835
brew "neovim"
cask "emacs"
cask "visual-studio-code"

brew "aspell"
brew "ctags"
brew "global"


# WEB Browser
cask "firefox"
cask "google-chrome"


# VM/Container
brew "colima"
brew "docker"
# cask "docker" # use colima
# cask "vagrant"


# Cloud Ops
brew "hashicorp/tap/terraform"
brew "awscli"
cask "aws-vault"


# Extend macOS
cask "alfred"
cask "bettertouchtool"
cask "hammerspoon"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"


# GUI Apps
cask "todoist"
cask "obsidian"
brew "syncthing", restart_service: true
cask "anki"

cask "slack"
cask "zoom"

mas "Dato", id: 1470584107
mas "Day One", id: 1055511498


# Fonts
cask "font-jetbrains-mono"
